
// 객체와 배열 연산자

// 객체와 배열, 함수에는 특별한 연산자가 있다.
// 점 연산자(.)와 대괄호 연산자([])는 이미 봤고,
// 나머지 연산자들은 6장과 8장, 9장에서 설명한다.
// 하지만, 이 장은 연산자에 관한 장이니 간단히 요약하고 넘어가겠다.

// 연산자             설명                       장
// .                점 연산자                    3     
// []               대괄호 연산자                 3
// in               프로퍼티 존재 연산자            9
// new              객체 인스턴스화 연산자          9
// instanceof       프로토타입 체인 테스트 연산자     9
// ...              확산 연산자                  6,8
// delete           삭제 연산자                  3